app/controllers/posters_controller.rb

SELECT * FROM `posters`
---
  def index
    @posters = Poster.all

SELECT * FROM `posters` WHERE (`posters`.`id` = 1)
---
  def show
    @poster = Poster.find(params[:id])

INSERT INTO `posters` (`name`, `created_at`, `updated_at`) VALUES('Softy', '2011-07-22 13:51:57', '2011-07-22 13:51:57')
---
  def create
    @poster = Poster.new(params[:poster])

    respond_to do |format|
      if @poster.save

SELECT * FROM `posters` WHERE (`posters`.`id` = 3)
DELETE FROM `posters` WHERE `id` = 3
---
  def destroy
    @poster = Poster.find(params[:id])
    @poster.destroy